"""
Напишите программу, которая получает целое число и возвращает его шестнадцатеричное
строковое представление. Функцию hex используйте для проверки своего результата.
"""

num = int(input('Введите целое число: '))

hex_dict = {0: "0", 1: "1", 2: "2", 3: "3", 4: "4", 5: "5", 6: "6", 7: "7", 8: "8", 9: "9", 10: "A",
            11: "B", 12: "C", 13: "D", 14: "E", 15: "F"}


def to_hex(n):
    result = ""
    while n > 0:
        remainder = n % 16
        hex_digit = hex_dict[remainder]
        result = hex_digit + result
        n = n // 16
    return result


hex_num = to_hex(num)

print("Шестнадцатеричное представление числа:", hex_num)
print("Проверка результата:", hex(num))